Revit 2024 API
ElectricalSystem.CircuitPathMode Property
 The circuit path mode of the electrical system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public ElectricalCircuitPathMode CircuitPathMode { get; set; }
Visual Basic
Public Property CircuitPathMode As ElectricalCircuitPathMode
	Get
	Set
Visual C++
public:
property ElectricalCircuitPathMode CircuitPathMode {
	ElectricalCircuitPathMode get ();
	void set (ElectricalCircuitPathMode value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The electrical system circuit path does not have customized path, so the CircuitPathMode cannot be set as Custom.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace